#### AddSet Method

---

|  |
| --- |
| SelectionFilterElement Class   See Also |

Adds a set of ElementIds to the filter's set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void AddSet( 	ICollection<ElementId> ids ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddSet ( _ 	ids As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddSet( 	ICollection<ElementId^>^ ids ) ``` |

#### Parameters

ids
:   Type:  System.Collections.Generic ICollection   ElementId
     The set of ElementIds to add.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SelectionFilterElement Class

Autodesk.Revit.DB Namespace